{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "df251876",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * Serving Flask app \"__main__\" (lazy loading)\n",
      " * Environment: production\n",
      "\u001b[31m   WARNING: This is a development server. Do not use it in a production deployment.\u001b[0m\n",
      "\u001b[2m   Use a production WSGI server instead.\u001b[0m\n",
      " * Debug mode: off\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      " * Running on http://127.0.0.1:5000/ (Press CTRL+C to quit)\n",
      "127.0.0.1 - - [21/Feb/2022 07:26:02] \"\u001b[37mGET / HTTP/1.1\u001b[0m\" 200 -\n",
      "127.0.0.1 - - [21/Feb/2022 07:26:03] \"\u001b[37mGET /graph HTTP/1.1\u001b[0m\" 200 -\n"
     ]
    }
   ],
   "source": [
    "# coding=utf-8\n",
    "from flask import Flask, jsonify, render_template\n",
    "from py2neo import *\n",
    "\n",
    "\n",
    "app = Flask(__name__)\n",
    "graph = Graph(\"http://localhost:7474\",auth=(\"neo4j\",\"123456\"))\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "@app.route('/')\n",
    "def index():\n",
    "    return render_template('index-2.html')\n",
    "\n",
    "\n",
    "#由code.js中的$.get('/graph', function(result) {}, 'json')调用\n",
    "#把neo4j的数据转成符合cytoscape要求的JSON数据存在code.js的result中\n",
    "@app.route('/graph')\n",
    "def get_graph():\n",
    "    #nodes = map(buildNodes, graph.run('MATCH (n) RETURN n')) #map()对每个节点调用buildNodes(nodeRecord)函数，生成数组nodes\n",
    "    #edges = map(buildEdges, graph.run('MATCH ()-[r]->() RETURN r'))  #生成了所有的边 \n",
    "\n",
    "    nodes = [{'data': {'id': '172', 'name': 'Tom Cruise', 'label': 'Person'}},\n",
    "                {'data': {'id': '183', 'title': 'Top Gun', 'label': 'Movie'}},\n",
    "                {'data': {'id': '200', 'name': 'AAA', 'label': 'Movie'}}]\n",
    "    edges = [{'data': {'source': '172', 'target': '183', 'relationship': 'Acted_In'}}]\n",
    "'''\n",
    "    nodes = [{'data': {'id': '7', 'name': '莫276EB1', 'label': '壁画'}}, \n",
    "             {'data': {'id': '4', 'name': '莫276', 'label': '洞窟'}}, \n",
    "             {'data': {'id': '0', 'name': '初唐', 'label': '朝代'}}, \n",
    "             {'data': {'id': '13', 'name': '本生故事画', 'label': '主题'}}, \n",
    "             {'data': {'id': '15', 'name': '单体', 'label': '布局'}}, \n",
    "             {'data': {'id': '17', 'name': '佛寺', 'label': '类型'}}, \n",
    "             {'data': {'id': '8', 'name': '莫276EB2', 'label': '壁画'}}, \n",
    "             {'data': {'id': '16', 'name': '建筑群', 'label': '布局'}}, \n",
    "             {'data': {'id': '9', 'name': '莫301EP1', 'label': '壁画'}}, \n",
    "             {'data': {'id': '5', 'name': '莫301', 'label': '洞窟'}},\n",
    "             {'data': {'id': '1', 'name': '盛唐', 'label': '朝代'}}, \n",
    "             {'data': {'id': '14', 'name': '佛传故事画', 'label': '主题'}},\n",
    "             {'data': {'id': '11', 'name': '莫442TOP1', 'label': '壁画'}}, \n",
    "             {'data': {'id': '6', 'name': '莫442', 'label': '洞窟'}}]\n",
    "    \n",
    "    edges = [{'data':{'source': '7', 'target': '4', 'relationship': '洞窟'}}, \n",
    "             {'data':{'source': '7', 'target': '0', 'relationship': '朝代'}}, \n",
    "             {'data':{'source': '7', 'target': '13', 'relationship': '主题'}}, \n",
    "             {'data':{'source': '7', 'target': '15', 'relationship': '布局'}},\n",
    "             {'data':{'source': '7', 'target': '17', 'relationship': '类型'}}, \n",
    "             {'data':{'source': '8', 'target': '4', 'relationship': '洞窟'}}, \n",
    "             {'data':{'source': '8', 'target': '0', 'relationship': '朝代'}}, \n",
    "             {'data':{'source': '8', 'target': '13', 'relationship': '主题'}},\n",
    "            {'data':{'source': '8', 'target': '16', 'relationship': '布局'}}, \n",
    "             {'data':{'source': '8', 'target': '17', 'relationship': '类型'}},\n",
    "             {'data':{'source': '9', 'target': '5', 'relationship': '洞窟'}}, \n",
    "             {'data':{'source': '9', 'target': '1', 'relationship': '朝代'}}, \n",
    "             {'data':{'source': '9', 'target': '14', 'relationship': '主题'}},\n",
    "             {'data':{'source': '9', 'target': '16', 'relationship': '布局'}}, \n",
    "             {'data':{'source': '9', 'target': '17', 'relationship': '类型'}}, \n",
    "            {'data':{'source': '11', 'target': '6', 'relationship': '洞窟'}},\n",
    "             {'data':{'source': '11', 'target': '1', 'relationship': '朝代'}}, \n",
    "             {'data':{'source': '11', 'target': '13', 'relationship': '主题'}}, \n",
    "             {'data':{'source': '11', 'target': '15', 'relationship': '布局'}}, \n",
    "             {'data':{'source': '11', 'target': '17', 'relationship': '类型'}}]\n",
    "    '''\n",
    "    return jsonify(elements = {\"nodes\": nodes, \"edges\": edges})    #用jsonify函数把elements转成JSON格式返回给前端   \n",
    "\n",
    "\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    app.run()    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "73ea2f67",
   "metadata": {},
   "outputs": [],
   "source": [
    "from functools import reduce\n",
    "\n",
    "c = [{'kk':'ll'}]\n",
    "a = {'a':'1','oo':'pp'}\n",
    "aa = {'a':'1','oo':'pp'}\n",
    "b = {'b':'2'}\n",
    "d = {'ww':'uu'}\n",
    "#n = c.append(a)\n",
    "#n = c.append(b)\n",
    "\n",
    "for m,n in zip(a,b):\n",
    "    c.append(a)\n",
    "    c.append(aa)\n",
    "    c.append(b)\n",
    "    c.append(d)\n",
    "\n",
    "print(c)\n",
    "\n",
    "#列表里的字典元素去重\n",
    "def list_dict_duplicate_removal():\n",
    "    run_function = lambda x, y: x if y in x else x + [y]\n",
    "    return reduce(run_function, [[], ] + c)\n",
    "\n",
    "j = list_dict_duplicate_removal()\n",
    "print(j)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "8ef6ce1b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# coding=utf-8\n",
    "from flask import Flask, jsonify, render_template\n",
    "from py2neo import *\n",
    "\n",
    "\n",
    "#app = Flask(__name__)\n",
    "graph = Graph(\"http://localhost:7474\",auth=(\"neo4j\",\"123456\"))\n",
    "\n",
    "\n",
    "\n",
    "def buildNodes(nodeRecord):\n",
    "    data = {\"id\": nodeRecord.get('n').get('id'),\n",
    "            \"name\": nodeRecord.get('n').get('name')}\n",
    "    return data\n",
    "\n",
    "def buildEdges(relationRecord):\n",
    "    data = {\"source\": relationRecord.get('r').start_node.get('id'),\n",
    "            \"target\": relationRecord.get('r').end_node.get('id'),\n",
    "            \"name\": relationRecord.get('r').get('relation')}\n",
    "    return data\n",
    "\n",
    "#@app.route('/get_allrelationship_json')\n",
    "def jsonifys1():\n",
    "    nodes = list(map(buildNodes, graph.run('MATCH (n) RETURN n').data()))\n",
    "    edges = list(map(buildEdges, graph.run('MATCH ()-[r]->() RETURN r').data()))\n",
    "    jsonData = json.dumps({'data': nodes, 'links': edges}, ensure_ascii=False)\n",
    "    print(nodes)\n",
    "    print(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "8abc471e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'q': Path(Node('壁画', name='莫301EB2', 基座1='null', 基座2='须弥座', 基座附件1='台阶', 基座附件2='栏杆', 墙饰1='null', 墙饰2='null', 墙饰3='null', 屋身1='null', 屋身2='null', 屋身3='null', 屋身结构附件1='额枋', 屋身结构附件2='null', 屋身结构附件3='null', 屋身结构附件4='null', 屋身结构附件5='null', 屋顶='庑殿顶', 屋顶结构附件1='檐椽', 屋顶结构附件2='null', 屋顶结构附件3='null', 方位='东壁', 瓦饰1='鸱尾', 瓦饰2='null', 瓦饰3='null', 瓦饰4='null'), cave(Node('壁画', name='莫301EB2', 基座1='null', 基座2='须弥座', 基座附件1='台阶', 基座附件2='栏杆', 墙饰1='null', 墙饰2='null', 墙饰3='null', 屋身1='null', 屋身2='null', 屋身3='null', 屋身结构附件1='额枋', 屋身结构附件2='null', 屋身结构附件3='null', 屋身结构附件4='null', 屋身结构附件5='null', 屋顶='庑殿顶', 屋顶结构附件1='檐椽', 屋顶结构附件2='null', 屋顶结构附件3='null', 方位='东壁', 瓦饰1='鸱尾', 瓦饰2='null', 瓦饰3='null', 瓦饰4='null'), Node('洞窟', name='莫301', 形制='覆斗顶形窟'))), 'id(a)': 10, 'id(b)': 5, 'labels(a)': ['壁画'], 'labels(b)': ['洞窟'], 'r': [cave(Node('壁画', name='莫301EB2', 基座1='null', 基座2='须弥座', 基座附件1='台阶', 基座附件2='栏杆', 墙饰1='null', 墙饰2='null', 墙饰3='null', 屋身1='null', 屋身2='null', 屋身3='null', 屋身结构附件1='额枋', 屋身结构附件2='null', 屋身结构附件3='null', 屋身结构附件4='null', 屋身结构附件5='null', 屋顶='庑殿顶', 屋顶结构附件1='檐椽', 屋顶结构附件2='null', 屋顶结构附件3='null', 方位='东壁', 瓦饰1='鸱尾', 瓦饰2='null', 瓦饰3='null', 瓦饰4='null'), Node('洞窟', name='莫301', 形制='覆斗顶形窟'))]}\n",
      "莫301EB2\n",
      "莫301\n",
      "10\n",
      "5\n",
      "壁画\n",
      "洞窟\n",
      "{'data': {'id': '10', 'name': '莫301EB2', 'label': '壁画'}} {'data': {'id': '5', 'name': '莫301', 'label': '洞窟'}}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'\\n数据转换为json\\n\\ndef buildNodes(nodeRecord):#读取节点\\n    data = {\"id\": str(nodeRecord.get(\\'n\\').get(\\'id\\')), \"name\": str(nodeRecord.get(\\'n\\').get(\\'name\\')),\"label\": str(nodeRecord.get(\\'n\\').get(\\'label\\'))}\\n    return {\"data\": data}\\n\\ndef buildEdges(relationRecord):#读取边\\n    data = {\"source\": str(relationRecord.get(\\'r\\').start_node.get(\\'id\\')),\\n            \"target\": str(relationRecord.get(\\'r\\').end_node.get(\\'id\\')),\\n            \"relationship\": str(\\'use\\')}\\n    return {\"data\": data}\\n\\ndef get_graph():#输出json\\n    nodes = list(map(buildNodes, graph.run(\\'MATCH (n) RETURN n\\').data()))\\n    edges = list(map(buildEdges, graph.run(\\'MATCH ()-[r]->() RETURN r\\').data()))\\n\\n    return jsonify(elements={\"nodes\": nodes, \"edges\": edges})\\n'"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#python版本号有4.2_python使用neo4j（4.2版本py2neo）\n",
    "#https://blog.csdn.net/weixin_32955455/article/details/114448090\n",
    "from flask import Flask, jsonify, render_template\n",
    "from py2neo import *\n",
    "graph = Graph(\"http://localhost:7474\",auth=(\"neo4j\",\"123456\"))\n",
    "\n",
    "'''\n",
    "#获取节点和关系数据\n",
    "\n",
    "result = graph.run('match (n:壁画) where n.屋顶=\"庑殿顶\"  return n,id(n),labels(n)').data()   #读取节点、ID、标签\n",
    "record = result[0]        #读取表中的一个数据\n",
    "node_name = record.get('n').get('name') #假设数据库中有一个属性(或者说是列名字)是name\n",
    "node_id = record['id(n)']              #读取id号\n",
    "node_label = ''.join(record['labels(n)'])  #读取标签，并用''.join(c)将列表转为字符串\n",
    "print(record)\n",
    "print(node_name)\n",
    "print(node_id)\n",
    "print(node_label)\n",
    "\n",
    "\n",
    "#result2 = graph.run('MATCH (n{name:\"莫301EB2\"})-[r*1..3]->()  RETURN r,id(r),type(r)').data()   # 无法在多层关系路径中使用id(r)和type(r)\n",
    "#因无法在多层关系路径中使用id(r)和type(r)，因此使用下面两个cypher语句代替,union合并：\n",
    "#'MATCH (n{name:\"莫301EB2\"})-[r]->()  RETURN r,id(r),type(r)'  union  'MATCH (n{name:\"莫301\"})-[r]->()  RETURN r,id(r),type(r)'\n",
    "result2 = graph.run('MATCH (n{name:\"莫301EB2\"})-[r]->()  RETURN r,id(r),type(r) union  MATCH (n{name:\"莫301\"})-[r]->()  RETURN r,id(r),type(r)').data()   # 读取边、ID、标签\n",
    "record2 = result2[4]   #读取一个边(关系)\n",
    "start = record2.get('r').start_node.get('name')   #读取边的起始节点的名字\n",
    "end = record2.get('r').end_node.get('name')     #读取边的目的节点的名字\n",
    "#start = record2['id(r)']    #关系的id\n",
    "relation = record2['type(r)']\n",
    "\n",
    "\n",
    "\n",
    "print(record2)\n",
    "print(start)\n",
    "print(end)\n",
    "print(relation)\n",
    "\n",
    "'''\n",
    "\n",
    "'''\n",
    "#获取查询结果\n",
    "#result = g.result\n",
    "result = [{'n.name': '莫276EB1'}, {'n.name': '莫276EB2'}, {'n.name': '莫301EP1'}, {'n.name': '莫442TOP1'}]\n",
    "print(result[0]['n.name'])\n",
    "\n",
    "\n",
    "n = len(result)     #统计壁画列表个数\n",
    "i = 0\n",
    "print(n)\n",
    "    '''\n",
    "\n",
    "#获取节点和关系数据\n",
    "graph_result = graph.run('match q =  (a) -[r*1..3]->(b) where a.name=\"莫301EB2\" return q,id(a),id(b),labels(a),labels(b),r').data()   #读取节点、ID、标签\n",
    "graph_record = graph_result[0]        #读取表中的一个数据\n",
    "start_node_name = graph_record.get('q').start_node.get('name')  #读取起始节点name\n",
    "end_node_name = graph_record.get('q').end_node.get('name')    #读取结束节点name\n",
    "start_node_id = graph_record['id(a)']            #读取起始节点id号\n",
    "end_node_id = graph_record['id(b)']\n",
    "start_node_label = ''.join(graph_record['labels(a)'])    #读取起始节点标签，并用''.join(c)将列表转为字符串\n",
    "end_node_label = ''.join(graph_record['labels(b)'])      #结束节点标签相当于关系类型\n",
    "\n",
    "#relation = record.get('r')[0]\n",
    "\n",
    "\n",
    "print(graph_record)\n",
    "print(start_node_name)\n",
    "print(end_node_name)\n",
    "print(start_node_id)\n",
    "print(end_node_id)\n",
    "print(start_node_label)\n",
    "print(end_node_label)\n",
    "\n",
    "#print(relation)\n",
    "data = []\n",
    "\n",
    "data_a = {\"id\":str(graph_record['id(a)']), \"name\": graph_record.get('q').start_node.get('name'),\n",
    "              \"label\": ''.join(graph_record['labels(a)'])}\n",
    "data_b = {\"id\":str(graph_record['id(b)']), \"name\": graph_record.get('q').end_node.get('name'),\n",
    "              \"label\": ''.join(graph_record['labels(b)'])}\n",
    "\n",
    "data_a = {\"data\":data_a}\n",
    "data_b = {\"data\":data_b}\n",
    "#data = data.append(data_a)\n",
    "#data = data.append(data_b)\n",
    "print(data_a,data_b)\n",
    "\n",
    "'''\n",
    "数据转换为json\n",
    "\n",
    "def buildNodes(nodeRecord):#读取节点\n",
    "    data = {\"id\": str(nodeRecord.get('n').get('id')), \"name\": str(nodeRecord.get('n').get('name')),\"label\": str(nodeRecord.get('n').get('label'))}\n",
    "    return {\"data\": data}\n",
    "\n",
    "def buildEdges(relationRecord):#读取边\n",
    "    data = {\"source\": str(relationRecord.get('r').start_node.get('id')),\n",
    "            \"target\": str(relationRecord.get('r').end_node.get('id')),\n",
    "            \"relationship\": str('use')}\n",
    "    return {\"data\": data}\n",
    "\n",
    "def get_graph():#输出json\n",
    "    nodes = list(map(buildNodes, graph.run('MATCH (n) RETURN n').data()))\n",
    "    edges = list(map(buildEdges, graph.run('MATCH ()-[r]->() RETURN r').data()))\n",
    "\n",
    "    return jsonify(elements={\"nodes\": nodes, \"edges\": edges})\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 163,
   "id": "9229da78",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'a': 'b', 'c': 'd'}\n"
     ]
    }
   ],
   "source": [
    "def Merge(a, b): \n",
    "    res = {**a, **b} \n",
    "    return res \n",
    "\n",
    "\n",
    "a = {'a':'b'}\n",
    "b = {'c':'d'}\n",
    "c = Merge(a,b)\n",
    "print(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e04687f2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "baa67222",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * Serving Flask app \"__main__\" (lazy loading)\n",
      " * Environment: production\n",
      "\u001b[31m   WARNING: This is a development server. Do not use it in a production deployment.\u001b[0m\n",
      "\u001b[2m   Use a production WSGI server instead.\u001b[0m\n",
      " * Debug mode: off\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      " * Running on http://127.0.0.1:5000/ (Press CTRL+C to quit)\n",
      "127.0.0.1 - - [21/Feb/2022 10:53:28] \"\u001b[37mGET / HTTP/1.1\u001b[0m\" 200 -\n",
      "127.0.0.1 - - [21/Feb/2022 10:53:28] \"\u001b[33mGET /graph HTTP/1.1\u001b[0m\" 404 -\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['kkk']\n"
     ]
    }
   ],
   "source": [
    "# coding=utf-8\n",
    "from flask import Flask, jsonify, render_template,g\n",
    "\n",
    "\n",
    "\n",
    "app = Flask(__name__)\n",
    "\n",
    "\n",
    "@app.route('/')\n",
    "def index():\n",
    "    a = ['kkk']\n",
    "    g.a = a\n",
    "    get_graph()  #调用get_graph()，g.a传给函数\n",
    "    \n",
    "    return render_template('index-2.html')\n",
    "\n",
    "\n",
    "@app.route('/1')\n",
    "def get_graph():\n",
    "    b = g.a\n",
    "    \n",
    "    print(b)\n",
    "    return   b\n",
    "\n",
    "\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    app.run()    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "301993cd",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
